// Программа симулирует работу маршрутки (4 остановки).
// Процесс: Объявление остановок, ввод от пользователя количества человек вышедших и зашедших на остановке.
// Оплата проезда и расчёт прибыли после вычета на зарплату водителю, на топливо, налог и ремонт.
//

#include <iostream>

int main()
{
    std::cout << "||============================================================================================================||\n";
    std::cout << "||======                                  !!! Minibus Simulator !!!                                     ======||\n";
    std::cout << "||======                                        <<-------->>                                            ======||\n";
    std::cout << "||======                                         Version#1.                                             ======||\n";
    std::cout << "||======                                         <guilang>                                              ======||\n";
    std::cout << "||============================================================================================================||\n";
    //
    std::cout << "||"
}
