// Программа симулирует работу маршрутки (4 остановки).
// Процесс: Объявление остановок, ввод от пользователя количества человек вышедших и зашедших на остановке.
// Оплата проезда и расчёт прибыли после вычета на зарплату водителю, на топливо, налог и ремонт.
//

#include <iostream>

int main()
{
    std::cout << "||============================================================================================================||\n";
    std::cout << "||======                                  !!! Minibus Simulator !!!                                     ======||\n";
    std::cout << "||======                                        <<-------->>                                            ======||\n";
    std::cout << "||======                                         Version#1.                                             ======||\n";
    std::cout << "||======                                         <guilang>                                              ======||\n";
    std::cout << "||============================================================================================================||\n";
    //
    //Bus station Name
    std::string part1BusStation1 = "Автобусный_парк";
    std::string part1BusStation2 = "Усадьба_Падающего_Снега";
    std::string part1BusStation3 = "Поместье_Времён_Года";
    std::string part1BusStation4 = "Поместье_Берег_Лотосов";
    //std::string part2BusStation1 = "";

    //account Variable
    int accountPartNumber = 0;

    
    

    //

    std::cout << "||";

}
