// devSquareNumber_chapter_3_2_Task_1.cpp
// Программа вычисления квадрата введённого пользователем числа.

#include <iostream>

int main()
{
    int a;
    //...
    setlocale(LC_ALL, "Russian");
    std::cout << "||============================================================================================================||\n";
    std::cout << "|| " << "Программа вычисления квадрата введённого пользователем числа.\n";
    std::cout << "|| " << "\n";
    std::cout << "|| " << "Введите произвольное целое число: ";
    std::cin >> a;
    std::cout << "||\n";
    std::cout << "|| " << "Вы ввели: " << a << "\n";
    std::cout << "||\n";
    std::cout << "|| " << "Квадрат числа: " << a << " равен: " << a * a << "\n";
    std::cout << "|| " << "\n";
    std::cout << "||============================================================================================================||\n";
}
